package _02Java基础概念._04计算机的存储规则;

public class Main {

    // Text文本, {数字, 字母, 汉字}
    // ---------------------------------
    // 在计算机中, 任意数据都是以二进制的形式来存储的！
    // 进制: 十进制(无), 十六进制(0x), 八进制(0), 二进制(0b)！
    // 进制之间的转换！
        // 系数{就是每一位上的数}, 基数{当前进制数}, 权{从左往右, 0, 1, 2, ...}
        // 8421快速转换法
        // 十进制转其他进制: 除基倒取余法
    // ---------------------------------
    // 计算机的存储规则: 美国信息交换标准码表

    // Image图片, {黑白图, 灰度图, 彩色图}
    // 像素: 分辨率比如1920*1080, 方形小格子！
    // 灰度: 0~255的灰度数据
    // 彩色图: 每个像素点记录不同的颜色, 三原色搭配出多种颜色！红绿蓝！一个红绿蓝(RGB)组合成一个像素点！强度0~255(FF)

    // Sound声音
    // 波形图！采样点越多, 音质越好！
    public static void main(String[] args) {


    }
}
